cities = [
    # خراسان
    "خوارزم",
    "توس",
    "سبزوار",
    "نیشابور",
    "بلخ",
    "بخارا",
    "سمرقند",
    "فاریاب",
    "پروان",
    "هرات",
    # اصفهان
    "اصفهان",
    "کاشان",
    "همدان",
    # بغداد
    "بغداد",
    "اهواز",
    "بعلبک",
    "قاهره",
    "بابل",
    # فارس
    "بیضا",
    "کازرون",
    "شیراز",
    # ری
    "ری",
    "قزوین",
]

city_category = {
    "خراسان": [
        "خوارزم",
        "توس",
        "سبزوار",
        "نیشابور",
        "بلخ",
        "بخارا",
        "سمرقند",
        "فاریاب",
        "پروان",
        "هرات",
    ],
    "اصفهان": [
        "اصفهان",
        "کاشان",
        "همدان",
    ],
    "ری": [
        "ری",
        "قزوین",
    ],
    "بغداد": [
        "بغداد",
        "اهواز",
        "بعلبک",
        "قاهره",
        "بابل",
    ],
    "فارس": [
        "بیضا",
        "کازرون",
        "شیراز",
    ],
    "نامشخص": ["نامشخص"],
}

url = "https://fa.wikipedia.org/wiki/%D9%81%D9%87%D8%B1%D8%B3%D8%AA_%D8%AF%D8%A7%D9%86%D8%B4%D9%85%D9%86%D8%AF%D8%A7%D9%86_%D8%A7%DB%8C%D8%B1%D8%A7%D9%86%DB%8C_%D9%BE%DB%8C%D8%B4_%D8%A7%D8%B2_%D8%AF%D9%88%D8%B1%D8%A7%D9%86_%D9%85%D8%B9%D8%A7%D8%B5%D8%B1"
